# DockablePaneId Class

---
Identifier for a pane that participates in the Revit docking window system.
SystemObject Autodesk.Revit.DBGuidEnum Autodesk.Revit.UIDockablePaneId
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class DockablePaneId : GuidEnum

    Public Class DockablePaneId
    	Inherits GuidEnum

    public ref class DockablePaneId : public GuidEnum

    type DockablePaneId =
        class
            inherit GuidEnum
        end
The DockablePaneId type exposes the following members.
| Name| Description
---|---|---
| DockablePaneId| Creates a new DockablePaneId instance.
Top
| Name| Description
---|---|---
| Guid|  The Guid of GUID-based enum object. (Inherited from GuidEnum)
Top
| Name| Description
---|---|---
| Equals|  Compares two Guid-based enum object based on their concrete class and GUID value. (Inherited from GuidEnum)
| GetHashCode|  Generates a hash code for this Guid-based enum object. (Inherited from GuidEnum)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
| Name| Description
---|---|---
| Equality(DockablePaneId, DockablePaneId)| Compares two DockablePaneId instances.
| Inequality(DockablePaneId, DockablePaneId)| Compares two DockablePaneId instances.
Top
#### Reference
Autodesk.Revit.UI Namespace